from utils.file_utils import UTILS_CONST,file_util_foo
from utils.api_utils import api_util_foo
import utils

from dotenv import load_dotenv
import os 
load_dotenv()
POLZA_API_KEY = os.getenv("POLZA_API_KEY")
IS_READY = True if os.getenv("IS_READY") == "True" else False

from utils import * # в __init__.py мы можем указать какие файлы действительно нужно импортировать
"""
Хлебные крошки запускаются через `Ctrl+Shift+.` (точка, которая находится на клавише «Ю»). По-моему, на русской раскладке тоже запускается. И вы можете использовать навигацию по хлебным крошкам — это очень удобно для перемещения внутри одного большого файла.

Ещё есть опция для навигации между файлами — это `Ctrl+Tab`. Вы можете видеть все файлы сверху во всплывающей подсказке.

А ещё есть замечательный `Ctrl+P`: можно просто начать вбивать название файла, и вам подскажут файлы, соответствующие этому названию.

Также есть `Ctrl+Shift+F` — это буквально полнотекстовый поиск по всему проекту, по всем документам. Допустим, я ищу `моя Pro` и нахожу такое вхождение в конкретном месте, в конкретном документе. Я могу кликнуть сюда или сюда, и у меня откроется нужное место — даже строчка подсвечивается. Очень удобно!
"""


"""####!PRACTICE!####
Попробуйте набрать эти три файла. У вас в проекте должна быть плоская структура. Рядом лежат три Python-файла: `main.py`, `utils.py` и `bananas.py`. Обратите внимание на импорты: вы должны набрать точно так, как написано у меня в коде. После этого ваша задача — запустить через Python файлик `main.py`. Обратите внимание на терминал: в терминале вы увидите хвосты, которые были импортированы фоном.

Принты, которые вы видите у меня в коде на строке номер 6 в файлике `utils.py` и на строке номер 1 в файлике `bananas.py`... Эти принты отработают, и печатают они одинаковую вещь — `__name__`. Но так как этот `__name__` придёт к нам в `main.py` из разных модулей, он будет иметь разные значения.

По сути, он как оборотень, который приобретает имя своего модуля, откуда он пришёл, если он пришёл из другого файла.
"""

"""
Обратите внимание, что наш файл `main.py` стал как сборочный цех: в него из папок, из вложенных в них файлов импортируется код, константы.

Импорт происходит в формате: `from <название папки>.<название файла> import <название функции>, <название другой функции>, <название константы>`. Таким образом, мы можем делать импорты в корень проекта, в какую-то точку входа, достаточно большого количества логики.

При этом, если необходимая логика живёт в папке, в подпапке, то импорт будет происходить следующим образом: `from <папка>.<подпапка>.<файл> import ...`, и дальше вы пишете то, что вам нужно импортировать.
"""

print(POLZA_API_KEY, IS_READY)

def main():
    file_util_foo(UTILS_CONST)
    api_util_foo("привет")
    print("Сейчас будет проверка выхода...")
    input("Нажмите Enter для выхода")

if __name__ == "__main__":
    main()